#include "header/SqStack.h"

void interface()

{
    printf("~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~\n");
    printf("~~~~~~~输入1    初始化栈~~~~~~~\n");
    printf("~~~~~~~输入2    栈是否为空~~~~~\n");
    printf("~~~~~~~输入3    得到栈顶元素~~~\n");
    printf("~~~~~~~输入4    清空栈~~~~~~~~~\n");
    printf("~~~~~~~输入5    销毁栈~~~~~~~~~\n");
    printf("~~~~~~~输入6    入栈~~~~~~~~~~~\n");
    printf("~~~~~~~输入7    出栈~~~~~~~~~~~\n");
    printf("~~~~~~~输入8    遍历栈~~~~~~~~~\n");
    printf("~~~~~~~输入9    检测栈长度~~~~~\n");
    printf("~~~~~~~~~~~~~~~~~~~~~~~~~~~~~\n"); 
}