void interface()

{
    printf("~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~\n");
    printf("~~~~~~~输入1    初始化~~~~~~~~~\n");
    printf("~~~~~~~输入2    是否空~~~~~~~~~\n");
    printf("~~~~~~~输入3    是否满~~~~~~~~~\n");
    printf("~~~~~~~输入4    得到首元素~~~~~\n");
    printf("~~~~~~~输入5    清空~~~~~~~~~~~\n");
    printf("~~~~~~~输入6    销毁~~~~~~~~~~~\n");
    printf("~~~~~~~输入7    入~~~~~~~~~~~~~\n");
    printf("~~~~~~~输入8    出~~~~~~~~~~~~~\n");
    printf("~~~~~~~输入9    遍历~~~~~~~~~~~\n");
    printf("~~~~~~~输入10   检测长度~~~~~~~\n");
    printf("~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~\n");
}